Repository: rhabbachi/ckanext-validation
Catalog: ckanext/validation/i18n/*/LC_MESSAGES/ckanext-validation.po
Languages: fr

source: Unauthorized to read this validation report
fr: Vous ne disposez pas des droits nécessaires pour consulter ce rapport de validation

source: No validation report exists for this resource
fr: Il n’existe aucun rapport de validation pour cette ressource

source: No foreign-key reference found. Does the referenced resource exist?
fr: Pas de clé étrangère trouvée. Est-ce que la ressource référencée existe?

source: Area ID in column {column_number} and row {row_number} is not found in the referenced geographic hierachy (resource id: {resource_id})
fr: La valeur de la colonne {column_number} et de la ligne {row_number} ne figure pas dans le tableau de données servant de référence : {resource_id}.

source: IO Error
fr: Erreur d'entrée/sortie

source: The data source returned an IO Error of type {error_type}
fr: La source des données a émis une erreur IO de type {error_type}.

source: Data reading error because of IO error. How it could be resolved: - Fix path if it's not correct.
fr: Impossible de lire les données en raison d’une erreur IO. Solution possible : - corrigez le chemin d’accès s’il est erroné.

source: HTTP Error
fr: Erreur HTTP

source: The data source returned an HTTP error with a status code of {status_code}
fr: La source des données a émis une erreur HTTP comportant un code de statut {status_code}.

source: Data reading error because of HTTP error. How it could be resolved: - Fix url link if it's not correct.
fr: Impossible de lire les données en raison d’une erreur HTTP. Solution possible : - corrigez le lien url s’il est erroné.

source: Source Error
fr: Erreur de source

source: The data source has not supported or has inconsistent contents; no tabular data can be extracted
fr: La source des données est incompatible avec le contenu ou comporte du contenu incohérent ; impossible d’extraire des données tabulaires

source: Data reading error because of not supported or inconsistent contents. How it could be resolved: - Fix data contents (e.g. change JSON data to array or arrays/objects). - Set correct source settings in {validator}.
fr: Impossible de lire les données en raison d’un contenu incompatible ou incohérent. Solutions possibles : - corrigez le contenu des données (par exemple, convertissez les données JSON en tableau ou tableaux/objets), - paramétrez correctement la source dans {validator}.

source: Scheme Error
fr: Erreur de schéma

source: The data source is in an unknown scheme; no tabular data can be extracted
fr: La source des données comporte un schéma inconnu ; impossible d’extraire des données tabulaires

source: Data reading error because of incorrect scheme. How it could be resolved: - Fix data scheme (e.g. change scheme from `ftp` to `http`). - Set correct scheme in {validator}.
fr: Impossible de lire les données en raison d’un schéma erroné. Solutions possibles : - corrigez le schéma des données (par exemple, convertissez le schéma ftp en http), - définissez un schéma exact dans {validator}.

source: Format Error
fr: Erreur de format

source: The data source is in an unknown format; no tabular data can be extracted
fr: La source des données comporte un format inconnu ; impossible d’extraire des données tabulaires

source: Data reading error because of incorrect format. How it could be resolved: - Fix data format (e.g. change file extension from `txt` to `csv`). - Set correct format in {validator}.
fr: Impossible de lire les données en raison d’un format erroné. Solutions possibles : - corrigez le format des données (par exemple, convertissez l’extension du fichier txt en csv), - définissez un format exact dans {validator}.

source: Encoding Error
fr: Erreur de codage

source: The data source could not be successfully decoded with {encoding} encoding
fr: Impossible de décoder la source des données avec le codage {encoding}

source: Data reading error because of an encoding problem. How it could be resolved: - Fix data source if it's broken. - Set correct encoding in {validator}.
fr: Impossible de lire les données en raison d’un problème de codage. Solutions possibles : - réparez la source des données si elle est endommagée, - définissez un codage exact dans {validator}.

source: Blank Header
fr: En-tête vide

source: Header in column {column_number} is blank
fr: L’en-tête de la colonne {column_number} est vide

source: A column in the header row is missing a value. Column names should be provided. How it could be resolved: - Add the missing column name to the first row of the data source. - If the first row starts with, or ends with a comma, remove it. - If this error should be ignored disable `blank-header` check in {validator}.
fr: Valeur manquante dans une colonne de la ligne en-têtes. Le nom des colonnes doit être indiqué. Solutions possibles : - ajoutez le nom de colonne manquant dans la première ligne de la source des données, - si la première ligne commence ou se termine par une virgule, supprimez-la, - si vous souhaitez ignorer cette erreur, décochez la vérification « en-tête vide » dans {validator}.

source: Duplicate Header
fr: En-tête existant déjà

source: Header in column {column_number} is duplicated to header in column(s) {column_numbers}
fr: L’en-tête de la colonne {column_number} est identique à l’en-tête de la/des colonnes(s) {column_numbers}.

source: Two columns in the header row have the same value. Column names should be unique. How it could be resolved: - Add the missing column name to the first row of the data. - If the first row starts with, or ends with a comma, remove it. - If this error should be ignored disable `duplicate-header` check in {validator}.
fr: Deux colonnes de la ligne en-têtes comportent la même valeur. Le nom des colonnes doit être unique. Solutions possibles : - ajoutez le nom de colonne manquant dans la première ligne de la source des données, - si la première ligne commence ou se termine par une virgule, supprimez-la, - si vous souhaitez ignorer cette erreur, décochez la vérification « en-tête existant déjà » dans {validator}.

source: Blank Row
fr: Ligne vide

source: Row {row_number} is completely blank
fr: La ligne {row_number} est vide

source: This row is empty. A row should contain at least one value. How it could be resolved: - Delete the row. - If this error should be ignored disable `blank-row` check in {validator}.
fr: Cette ligne est vide. Les lignes doivent comporter au moins une valeur. Solutions possibles : - supprimez la ligne, - si vous souhaitez ignorer cette erreur, décochez la vérification « ligne vide » dans {validator}.

source: Duplicate Row
fr: Ligne existant déjà

source: Row {row_number} is duplicated to row(s) {row_numbers}
fr: La ligne {row_number} est identique à la/aux ligne(s) {row_numbers}.

source: The exact same data has been seen in another row. How it could be resolved: - If some of the data is incorrect, correct it. - If the whole row is an incorrect duplicate, remove it. - If this error should be ignored disable `duplicate-row` check in {validator}.
fr: Des données identiques sont déjà présentes dans une autre ligne. Solutions possibles : - si une partie des données est erronée, corrigez-les, - si l’ensemble de la ligne est un doublon erroné, supprimez-la, - si vous souhaitez ignorer cette erreur, décochez la vérification « ligne existant déjà » dans {validator}.

source: Extra Value
fr: Valeur supplémentaire

source: Row {row_number} has an extra value in column {column_number}
fr: La ligne {row_number} comporte une valeur supplémentaire dans la colonne {column_number}.

source: This row has more values compared to the header row (the first row in the data source). A key concept is that all the rows in tabular data must have the same number of columns. How it could be resolved: - Check data has an extra comma between the values in this row. - If this error should be ignored disable `extra-value` check in {validator}.
fr: Cette ligne comporte plus de valeurs que la ligne d’en-têtes (la première ligne de la source des données). Dans les données tabulaires, toutes les lignes doivent comporter un nombre identique de colonnes. Il s’agit là d’un principe important. Solutions possibles : - vérifiez si une virgule supplémentaire s’est glissée entre les valeurs de cette ligne, - si vous souhaitez ignorer cette erreur, décochez la vérification « valeur supplémentaire » dans {validator}.

source: Missing Value
fr: Valeur manquante

source: Row {row_number} has a missing value in column {column_number}
fr: La ligne {row_number} comporte une valeur manquante dans la colonne {column_number}.

source: This row has less values compared to the header row (the first row in the data source). A key concept is that all the rows in tabular data must have the same number of columns. How it could be resolved: - Check data is not missing a comma between the values in this row. - If this error should be ignored disable `missing-value` check in {validator}.
fr: Cette ligne comporte moins de valeurs que la ligne d’en-têtes (la première ligne de la source des données). Dans les données tabulaires, toutes les lignes doivent comporter un nombre identique de colonnes. Il s’agit là d’un principe important. Solutions possibles : - vérifiez qu’il ne manque pas une virgule entre les valeurs de cette ligne, - si vous souhaitez ignorer cette erreur, décochez la vérification « valeur manquante » dans {validator}.

source: Table Schema Error
fr: Erreur de schéma du tableau

source: Table Schema error: {error_message}
fr: Erreur de schéma du tableau : {error_message}

source: Provided schema is not valid. How it could be resolved: - Update schema descriptor to be a valid descriptor - If this error should be ignored disable schema checks in {validator}.
fr: Le schéma fourni n’est pas valide. Solutions possibles : - corrigez le descripteur du schéma de manière à ce qu’il soit valide, - si vous souhaitez ignorer cette erreur, décochez les vérifications correspondant au schéma dans {validator}.

source: Non-Matching Header
fr: En-tête incohérent

source: Header in column {column_number} doesn't match field name {field_name} in the schema
fr: L’en-tête de la colonne {column_number} ne correspond pas au nom du champ {field_name} dans le schéma

source: One of the data source headers doesn't match the field name defined in the schema. How it could be resolved: - Rename header in the data source or field in the schema - If this error should be ignored disable `non-matching-header` check in {validator}.
fr: Dans la source des données, l’un des en-têtes ne correspond pas au nom de champ défini dans le schéma. Solutions possibles : - renommez l’en-tête dans la source des données ou le champ dans le schéma, - si vous souhaitez ignorer cette erreur, décochez la vérification « en-tête incohérent » dans {validator}.

source: Extra Header
fr: En-tête supplémentaire

source: There is an extra header in column {column_number}
fr: La colonne {column_number} comporte un en-tête supplémentaire.

source: The first row of the data source contains header that doesn't exist in the schema. How it could be resolved: - Remove the extra column from the data source or add the missing field to the schema - If this error should be ignored disable `extra-header` check in {validator}.
fr: La première ligne de la source des données n’existe pas dans le schéma. Solutions possibles : - supprimez la colonne supplémentaire dans la source des données ou ajoutez le champ manquant dans le schéma, - si vous souhaitez ignorer cette erreur, décochez la vérification « en-tête supplémentaire » dans {validator}.

source: Missing Header
fr: En-tête manquant

source: There is a missing header in column {column_number}
fr: Il manque un en-tête dans la colonne {column_number}.

source: Based on the schema there should be a header that is missing in the first row of the data source. How it could be resolved: - Add the missing column to the data source or remove the extra field from the schema - If this error should be ignored disable `missing-header` check in {validator}.
fr: D’après le schéma, il manque un en-tête qui devrait être présent dans la première ligne de la source des données. Solutions possibles : - ajoutez la colonne manquante dans la source des données ou supprimez le champ supplémentaire dans le schéma, - si vous souhaitez ignorer cette erreur, décochez la vérification « en-tête manquant » dans {validator}.

source: Type or Format Error
fr: Erreur de type ou de format

source: The value {value} in row {row_number} and column {column_number} is not type {field_type} and format {field_format}
fr: La valeur {value} dans la ligne {row_number} et la colonne {column_number} ne correspond pas au type {field_type} et au format {field_format}.

source: The value does not match the schema type and format for this field. How it could be resolved: - If this value is not correct, update the value. - If this value is correct, adjust the type and/or format. - To ignore the error, disable the `type-or-format-error` check in {validator}. In this case all schema checks for row values will be ignored.
fr: La valeur ne correspond pas au type et format de schéma pour ce champ. Solutions possibles : - si cette valeur est erronée, corrigez-la, - si cette valeur est exacte, modifiez le type et/ou le format, - si vous souhaitez ignorer cette erreur, décochez la vérification « erreur de type ou de format » dans {validator}. Par la suite, toutes les vérifications du schéma pour les valeurs de cette ligne seront ignorées.

source: Required Constraint
fr: Valeur obligatoire

source: Column {column_number} is a required field, but row {row_number} has no value
fr: La ligne {row_number} ne comporte aucune valeur, alors que la colonne {column_number} correspond à un champ obligatoire

source: This field is a required field, but it contains no value. How it could be resolved: - If this value is not correct, update the value. - If value is correct, then remove the `required` constraint from the schema. - If this error should be ignored disable `required-constraint` check in {validator}.
fr: Ce champ ne comporte aucune valeur, alors qu’il est obligatoire. Solutions possibles : - si cette valeur est erronée, corrigez-la, - si cette valeur est exacte, retirez le paramètre « obligatoire » dans le schéma, - si vous souhaitez ignorer cette erreur, décochez la vérification « valeur obligatoire » dans {validator}.

source: Pattern Constraint
fr: Forme obligatoire

source: The value {value} in row {row_number} and column {column_number} does not conform to the pattern constraint of {constraint}
fr: La valeur {value} dans la ligne {row_number} et la colonne {column_number} ne correspond pas à la forme obligatoire définie dans {constraint}.

source: This field value should conform to constraint pattern. How it could be resolved: - If this value is not correct, update the value. - If value is correct, then remove or refine the `pattern` constraint in the schema. - If this error should be ignored disable `pattern-constraint` check in {validator}.
fr: La valeur de ce champ doit correspondre à la forme obligatoire. Solutions possibles : - si cette valeur est erronée, corrigez-la, - si cette valeur est exacte, retirez ou affinez la forme obligatoire dans le schéma, - si vous souhaitez ignorer cette erreur, décochez la vérification « forme obligatoire » dans {validator}.

source: Unique Constraint
fr: Valeur unique obligatoire

source: Rows {row_numbers} has unique constraint violation in column {column_number}
fr: Les lignes {row_numbers} ne correspondent pas au paramètre de valeur unique obligatoire dans la colonne {column_number}.

source: This field is a unique field but it contains a value that has been used in another row. How it could be resolved: - If this value is not correct, update the value. - If value is correct, then the values in this column are not unique. Remove the `unique` constraint from the schema. - If this error should be ignored disable `unique-constraint` check in {validator}.
fr: Ce champ comporte une valeur déjà présente dans une autre ligne, alors que les valeurs doivent obligatoirement être uniques. Solutions possibles : - si cette valeur est erronée, corrigez-la, - si cette valeur est exacte, cela signifie que les valeurs de cette colonne ne sont pas uniques. Par conséquent, retirez le paramètre obligatoire « unique » dans le schéma, - si vous souhaitez ignorer cette erreur, décochez la vérification « valeur unique obligatoire » dans {validator}.

source: Invalid Value
fr: Valeur non valide

source: The value {value} in row {row_number} and column {column_number} is not found in the list of valid values for this field: {constraint}
fr: La valeur {value} dans la ligne {row_number} et la colonne {column_number} ne figure pas parmi les valeurs valides pour ce champ : {constraint}.

source: This field value should be equal to one of the values in a pre-specified list. Please update the value making sure it exactly matches one of the valid values in the specified list.
fr: La valeur de ce champ doit être égale à l’une des valeurs figurant dans une liste prédéfinie. Veuillez corriger cette valeur en veillant à ce qu’elle soit identique à l’une des valeurs valides prédéfinies.

source: Minimum Constraint
fr: Valeur minimale

source: The value {value} in row {row_number} and column {column_number} does not conform to the minimum constraint of {constraint}
fr: La valeur {value} dans la ligne {row_number} et la colonne {column_number} ne correspond pas à la valeur minimale de {constraint}.

source: This field value should be greater or equal than constraint value. How it could be resolved: - If this value is not correct, update the value. - If value is correct, then remove or refine the `minimum` constraint in the schema. - If this error should be ignored disable `minimum-constraint` check in {validator}.
fr: La valeur de ce champ doit être supérieure ou égale à la valeur minimale. Solutions possibles : - si cette valeur est erronée, corrigez-la, - si cette valeur est exacte, supprimez ou affinez la valeur minimale dans le schéma, - si vous souhaitez ignorer cette erreur, décochez la vérification « valeur minimale » dans {validator}.

source: Maximum Constraint
fr: Valeur maximale

source: The value {value} in row {row_number} and column {column_number} does not conform to the maximum constraint of {constraint}
fr: La valeur {value} dans la ligne {row_number} et la colonne {column_number} ne correspond pas à la valeur maximale de {constraint}.

source: This field value should be less or equal than constraint value. How it could be resolved: - If this value is not correct, update the value. - If value is correct, then remove or refine the `maximum` constraint in the schema. - If this error should be ignored disable `maximum-constraint` check in {validator}.
fr: La valeur de ce champ doit être inférieure ou égale à la valeur maximale. Solutions possibles : - si cette valeur est erronée, corrigez-la, - si cette valeur est exacte, supprimez ou affinez la valeur maximale dans le schéma, - si vous souhaitez ignorer cette erreur, décochez la vérification « valeur maximale » dans {validator}.

source: Minimum Length Constraint
fr: Longueur minimale

source: The value {value} in row {row_number} and column {column_number} does not conform to the minimum length constraint of {constraint}
fr: La valeur {value} dans la ligne {row_number} et la colonne {column_number} ne correspond pas à la longueur minimale de {constraint}.

source: A length of this field value should be greater or equal than schema constraint value. How it could be resolved: - If this value is not correct, update the value. - If value is correct, then remove or refine the `minimumLength` constraint in the schema. - If this error should be ignored disable `minimum-length-constraint` check in {validator}.
fr: Dans ce champ, la longueur de la valeur doit être supérieure ou égale à la valeur définie dans le schéma. Solutions possibles : - si cette valeur est erronée, corrigez-la, - si cette valeur est exacte, supprimez ou affinez la longueur minimale dans le schéma, - si vous souhaitez ignorer cette erreur, décochez la vérification « longueur minimale » dans {validator}.

source: Maximum Length Constraint
fr: Longueur maximale

source: The value {value} in row {row_number} and column {column_number} does not conform to the maximum length constraint of {constraint}
fr: La valeur {value} dans la ligne {row_number} et la colonne {column_number} ne correspond pas à la longueur maximale de {constraint}.

source: A length of this field value should be less or equal than schema constraint value. How it could be resolved: - If this value is not correct, update the value. - If value is correct, then remove or refine the `maximumLength` constraint in the schema. - If this error should be ignored disable `maximum-length-constraint` check in {validator}.
fr: Dans ce champ, la longueur de la valeur doit être inférieure ou égale à la valeur définie dans le schéma. Solutions possibles : - si cette valeur est erronée, corrigez-la, - si cette valeur est exacte, supprimez ou affinez la longueur maximale dans le schéma, - si vous souhaitez ignorer cette erreur, décochez la vérification « longueur maximale » dans {validator}.

source: Geometry Error
fr: Erreur de géométrie

source: There is no geometry specified for row {row_number}.
fr: Aucune géométrie n’a été définie pour la colonne {row_number}.

source: Every record in a geometry file, must include geometry co-ordinates.
fr: Dans un fichier de géométrie, tous les enregistrements doivent comprendre des coordonnées géométriques.

source: Area ID Error
fr: Erreur d’identifiant de zone

source: Value in column {column_number} and row {row_number} is not found in the referenced data table: {resource_id}
fr: La valeur de la colonne {column_number} et de la ligne {row_number} ne figure pas dans le tableau de données servant de référence : {resource_id}.

source: Area IDs must match those from the referenced location hierachy. Please check the location hierachy.
fr: Les identifiants de zones doivent correspondre aux identifiants figurant dans la hiérarchie des lieux définie. Veuillez vérifier cette dernière.

source: Valid data
fr: Données valides

source: Invalid data
fr: Données non valides

source: Error during validation
fr: Erreur de validation

source: Data validation unknown
fr: Validation des données inconnue

source: There are validation issues with this file, please see the <a {params}>report</a> for details. Once you have resolved the issues, click the button below to replace the file.
fr: Ce fichier comporte des problèmes de validation. Consultez le <a {params}>rapport</a> pour plus de détails. Une fois ces problèmes résolus, cliquez sur le bouton ci-dessous pour remplacer le fichier.

source: Unexpected error while processing resource validation. Please check your input file and if necessary report a bug using the link in the page footer.
fr: Erreur inattendue lors du traitement de la validation des ressources. Veuillez vérifier votre fichier d'entrée et si nécessaire signaler un problème en utilisant le lien en bas du page.

source: No tables found
fr: Aucun tableau trouvé

source: Incorrect Extension
fr: Extension erronée

source: Cannot validate the file. Please check the file extension is correct.
fr: Impossible de valider le fichier. Veuillez vérifier que l’extension du fichier est exacte.

source: Could not decode your CSV file. Please, make sure your file is utf-8 encoded.
fr: Impossible de lire votre fichier CSV. Veuillez s’assurer que votre fichier est encodé utf-8.

source: Could not read your CSV file. Are you sure your specified format {} is correct?
fr: Impossible de lire votre fichier CSV. Êtes-vous sûr que le format indiqué {} est exact ?
