Repository: rhabbachi/ckanext-validation
Catalog: ckanext/validation/i18n/*/LC_MESSAGES/ckanext-validation.po
Languages: fr

source: Could not read your Excel file. Are you sure your specified format {} is correct?
fr: Impossible de lire votre fichier Excel. Êtes-vous sûr que le format indiqué {} est exact ?

source: Multiple Worksheets
fr: Feuilles de calcul multiples

source: Your Excel file must contain only one worksheet for validation.
fr: Votre fichier Excel doit contenir une seule feuille de calcul à valider.

source: Resource format set to 'JSON', but an error occured whilst reading JSON. Are you sure this resource is a valid JSON file?
fr: Format de ressource défini sur «JSON», mais une erreur s'est produite lors de la lecture de JSON. Êtes-vous sûr que cette ressource est un fichier JSON valide?

source: Unable to import JSON:
fr: Impossible d’importer l'object JSON:

source: SHP File
fr: Fichier SHP

source: Could not unzip file:
fr: Impossible de décompresser le fichier:

source: Zipped archive must contain exactly one .shp file.
fr: L’archive compressée doit contenir exactement un fichier .shp.

source: Not a valid shp file:
fr: Le fichier n’est pas un fichier shp valide:

source: Required Foreign Key Configuration
fr: Configuration de clé étrangère requise

source: Missing {} field
fr: Champ {} manquant

source: Missing value
fr: Valeur manquante

source: Unsupported resource format.Must be one of {}
fr: Format de ressource incompatible. Doit obligatoirement être un format {}.

source: Resource must have a valid URL or an uploaded file
fr: La ressource doit comporter une URL valide ou un fichier transféré

source: Resource was not found.
fr: La ressource n’a pas été trouvée.

source: Must be a valid URL
fr: Doit être une URL valide

source: Invalid Table Schema descriptor: {}
fr: Descripteur schéma tableau non valide : {}

source: JSON error in Table Schema descriptor: {}
fr: Erreur JSON dans le descripteur schéma tableau : {}

source: Invalid Table Schema: {}
fr: Schéma tableau non valide : {}

source: Upload
fr: Télécharger

source: Upload a Data Schema file from your computer
fr: Transférez un fichier de schéma de données à partir de votre ordinateur

source: Link
fr: Lien

source: URL for a Data Schema file available on the Internet
fr: URL d’un fichier de schéma de données disponible sur Internet

source: Enter manually a Table Schema JSON object
fr: Saisissez manuellement un objet JSON respectant le schéma Table (Table Schema)

source: Clear
fr: Effacer

source: Data Schema
fr: Schéma de données

source: Data Schema URL
fr: URL Schéma de données

source: Uploaded Data Schema
fr: Schéma de données transférées

source: Schema
fr: Schéma

source: Stop on first error
fr: Arrêter à la première erreur

source: Indicate whether validation should stop on the first error, or attempt to collect all errors.
fr: Indiquez si la validation doit s’arrêter à la première erreur ou tenter de compiler toutes les erreurs.

source: Ignore blank rows
fr: Ignorer les lignes vides

source: Indicate whether blank rows should be considered as errors, or simply ignored.
fr: Indiquez si les lignes vides doivent être considérées comme des erreurs ou être simplement ignorées.

source: Ignore duplicate rows
fr: Ignorer les lignes doublons

source: Indicate whether duplicate rows should be considered as errors, or simply ignored.
fr: Indiquez si les lignes existant déjà doivent être considérées comme des erreurs ou être simplement ignorées.

source: There is fatal error in validation
fr: La validation présente une erreur fatale

source: Error details
fr: Détails de l’erreur

source: Invalid
fr: Non valide

source: The full list of error messages:
fr: Liste complète des messages d’erreurs :

source: Show next 10 rows
fr: Afficher les 10 lignes suivantes

source: Resource ID:
fr: Identifiant ressource :

source: Edit Foreign Key References
fr: Configuration de clé étrangère

source: External References (Foreign Keys)
fr: Références externes (clés étrangères)

source: Browse Data
fr: Parcourir les données

source: This resource table has fields whose values must match those specified in another table. For each field below, <a target="_blank" href="/dataset">please browse the data</a> to find the other table where these values are defined. Copy and paste the resource's ID below. E.g. For area_id you should find your finalised Geographic Data package, and copy and paste the resource ID of the location hierarchy below.
fr: Cette table de ressources contient des champs dont les valeurs doivent correspondre à celles spécifiées dans une autre table. Pour chaque champ ci-dessous, <a target="_blank" href="/dataset"> veuillez parcourir les données </a> pour trouver l'autre tableau dans lequel ces valeurs sont définies. Copiez et collez l'ID de la ressource ci-dessous. Par exemple. Pour area_id, vous devez trouver votre package de données géographiques finalisé, puis copier et coller l'ID de ressource de la hiérarchie d'emplacement ci-dessous.

source: You can pass a JSON object of validation options. See <a href="https://github.com/frictionlessdata/ckanext-validation#validation-options">here</a> for more information.
fr: Vous pouvez passer un objet JSON correspondant à des options de validation. Plus d’informations <a href="https://github.com/frictionlessdata/ckanext-validation#validation-options">ici</a>.

source: Validation Report
fr: Rapport de validation

source: Validation timestamp
fr: Validation horodatage

source: Duration
fr: Durée

source: Error validating data
fr: Erreur de validation des données

source: Data Validation Report
fr: Rapport de validation des données
